<template>
  <div>
    <b-container>
      <b-row>
        <b-col cols="1"></b-col>
        <b-col cols="10" align="left">
          <b-card class="mb-2 mt-2">
            <div>
              <h3>Определения</h3>
              <ul>
                <li><a href="#experiment">Эксперимент</a></li>
                <li><a href="#main_experiment">Основной эксперимент</a></li>
                <li><a href="#add_experiment">Дополнительный эксперимент</a></li>
                <li><a href="#factor">Фактор</a></li>
                <li><a href="#response">Отклик объекта</a></li>
                <li><a href="#order">Порядок объекта</a></li>
                <li><a href="#factor_change_interval">Допустимый диапазон изменения факторов</a></li>
                <li><a href="#plan">План эксперимента</a></li>
                <li><a href="#plan_points">Точка плана</a></li>
                <li><a href="#plan_spectre">Спектр плана</a></li>
                <li><a href="#normalization">Операция нормализации</a></li>
                <li><a href="#plan_center">Центр области планирования</a></li>
                <li><a href="#factor_main">Основной уровень фактора</a></li>
                <li><a href="#factor_level">Уровень фактора</a></li>
                <li><a href="#exp_numb">Количество опытов</a></li>
                <li><a href="#interval_factor">Интервал варьирования фактора</a></li>
                <li><a href="#freedom_degree">Число степеней свободы</a></li>
                <li><a href="#hypo">Гипотеза</a></li>
                <li><a href="#criteria">Критерий</a></li>
                <li><a href="#statistic">Статистика</a></li>
                <li><a href="#criteria_stat">Критерий статистической гипотезы</a></li>
                <li><a href="#sign_level">Уровень значимости</a></li>
                <li><a href="#cochrain_1">Распределение Кохрена</a></li>
                <li><a href="#cochrain_2">Критерий Кохрена</a></li>
                <li><a href="#cochrain_3">Критическое значение критерия Кохрена</a></li>
                <li><a href="#matrix">Матрица численных значений базисных функций</a></li>
                <li><a href="#var_obj">Список существенных переменных объекта</a></li>
                <li><a href="#basis">Базисные функции</a></li>
                <li><a href="#fisher_1">Критерий Фишера</a></li>
                <li><a href="#fisher_2">Распределение Фишера</a></li>
                <li><a href="#fisher_3">Критическое значение критерия Фишера</a></li>
              </ul>
              <hr>
              <div id="experiment">
                <h2>Эксперимент</h2>
                <p>Эксперимент - система воздействий и наблюдений, направленных на получение информации об объекте при проведении испытаний.</p>
                <p>В лабораторных работах рассматривается активный эксперимент, т.е. принято, что объект исследования имеет только управляемые и контролируемые факторы, значения которых можно целенаправленно изменять в ходе эксперимента в соответствии с построенным <a href="#plan">планом эксперимента</a>, а действие неуправляемых и неконтролируемых факторов учитывается статистически.</p>
                <p>Отдельной элементарной частью эксперимента является опыт - измерение значения <a href="#response">отклика</a> в определенных условиях: в конкретной точке плана.</p>
                <p>В лабораторных работах предусмотрено проведение основного и дополнительного эксперимента.</p>
                <hr>
              </div>
              <div id="main_experiment">
                <h2>Основной эксперимент</h2>
                <p>Результатом проведения основного эксперимента является получение значений отклика во всех <a href="#plan_points">точках плана</a>, которые заносятся в таблицу, строки которой соответствуют номерам точек плана, а столбцы - номерам параллельных опытов.</p>
                <table class="table table-bordered">
              <thead>
                <tr>
                  <th rowspan="2">Точка ФП</th>
                  <th colspan="3" align="center">Параллельные опыты</th>
                </tr>
                <tr>
                  <th>1</th>
                  <th>2</th>
                  <th>3</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>1</td>
                  <td>287.96</td>
                  <td>287.11</td>
                  <td>287.79</td>
                </tr>
                <tr>
                  <td>2</td>
                  <td>-149.15</td>
                  <td>-149.15</td>
                  <td>-147.69</td>
                </tr>
                <tr>
                  <td>3</td>
                  <td>-303.06</td>
                  <td>-302.36</td>
                  <td>-302.66</td>
                </tr>
                <tr>
                  <td>4</td>
                  <td>159.70</td>
                  <td>160.99</td>
                  <td>159.69</td>
                </tr>
              </tbody>
            </table>
                <p>Например, значение отклика во второй точке плана ( или точке факторного пространства) в третьем параллельном опыте - -147.69.</p>
                <hr>
              </div>
              <div id="add_experiment">
                <h2>Дополнительный эксперимент</h2>
                <p>Дополнительный эксперимент имеет смысл проводить только в том случае, если установлено, что для вычисления дисперсии адекватности не хватает числа степеней свободы.</p>
                <p>Дополнительные испытания обычно проводятся в центре области планирования, т.к. это приводит к более простым расчетам.</p>
                <p>Результат дополнительного эксперимента заносятся в таблицу значений отклика, в которую ранее были записаны значения, полученные в <a href="#main_experiment">основном эксперименте</a>. Т.е. к таблице значений отклика добавляется новая строка, соответствующая дополнительной точке - центру области планирования.</p>
                <hr>
              </div>
              <div id="factor">
                <h2>Фактор</h2>
                <p>Фактор - входная контролируемая переменная объекта. В лабораторных работах рассматриваются только управляемые переменные, т.е. те, которые исследователь может изменять по своему усмотрению.</p>
                <p>Факторы в работе обозначаются следующим образом:<br>Х1, Х2, ..., Х5.</p>
                <p>Принято, что объект может иметь не более пяти факторов. Число факторов объекта обозначается n.</p>
                <p>Влияние неуправляемых и неконтролируемых факторов сводится к действию случайной нормально распределенной ошибки, суммирующейся с <a href="#response">откликом объекта</a>.</p>
                <p>Случайная ошибка моделируется с помощью датчика нормально распределенных случайных чисел с нормальным распределением, имеющим нулевое математическое ожидание и дисперсию, определяемую при выборе варианта задания средним квадратическим отклонением.</p>
                <p>Пространство контролируемых переменных образует факторное пространство.</p>
                <p>Точкой факторного пространства является вектор упорядоченных значений факторов.</p><hr>
              </div>
              <div id="response">
                <h2>Отклик объекта</h2>
                <p>Отклик объекта - реакция объекта на заданное воздействие.</p>
                <hr>
              </div>
              <div id="order">
                <h2>Порядок объекта</h2>
                <p>Порядок объекта - максимальный порядок вхождения факторов в базисные функции. </p>
                <p>Объекты первого порядка - те объекты, список существенных переменных для которых включает только базисные функции, содержащие факторы в степенях, не превышающих единицу.</p>
                <p>Объекты второго порядка - те объекты, список существенных переменных для которых включает базисные функции, содержащие квадраты факторов.</p><hr>
              </div>
              <div id="factor_change_interval">
                <h2>Допустимый диапазон изменения факторов</h2>
                <p>Допустимый диапазон изменения факторов - область значений факторов, в которой имеет смысл измерять отклик объекта.</p>
                <p>В работе принято, что допустимый диапазон изменения факторов лежит в пределах от -100 до 100.</p>
                <hr>
              </div>
              <div id="plan">
                <h2>План эксперимента</h2>
                <p>План эксперимента - совокупность данных, определяющих число, условия и порядок реализации опытов в ходе эксперимента - совокупность всех <a href="#plan_points">точек плана</a>.</p>
                <p>Результатом планирования эксперимента является построение спектра плана эксперимента выбранного типа, определение количества опытов в каждой точке плана и задание порядка проведения опытов.</p>
                <hr>
              </div>
              <div id="plan_points">
                <h2>Точка плана</h2>
                <p>Точка плана - упорядоченная совокупность численных значений <a href="#factor">факторов</a> - точка факторного пространства, соответствующая условиям проведения определенного опыта.</p>
                <p>Точке плана с определенным номером отвечает вектор, компоненты которого - значения факторов в соответствующем опыте, упорядоченные по номерам факторов.</p>
                <hr>
              </div>
              <div id="plan_spectre">
                <h2>Спектр плана</h2>
                <p>Спектр плана - совокупность несовпадающих точек плана. Обычно записывается в стандартной форме - в виде матрицы спектра плана, представляющей собой таблицу, строки которой отвечают точкам факторного пространства, включенным в план, а столбцы факторам объекта. Т.е. любой элемент матрицы спектра плана - это численное значение фактора с номером, соответствующим номеру текущего столбца, в точке плана с номером текущей строки.</p>
                <p>Число точек спектра плана обозначается N.</p>
                <p>Как правило, матрица спектра плана записывается для нормализованных факторов.</p>
                <table class="table table-bordered">
              <thead>
                <tr>
                  <th>Точка плана</th>
                  <th>Х1</th>
                  <th>Х2</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>1</td>
                  <td>-1</td>
                  <td>-1</td>
                </tr>
                <tr>
                  <td>2</td>
                  <td>+1</td>
                  <td>-1</td>
                </tr>
                <tr>
                  <td>3</td>
                  <td>-1</td>
                  <td>+1</td>
                </tr>
                <tr>
                  <td>4</td>
                  <td>+1</td>
                  <td>+1</td>
                </tr>
              </tbody>
            </table>
                <hr>
              </div>
              <div id="normalization">
                <h2>Операция нормализации</h2>
                <p>Операция нормализации сводится к изменению начала отсчета координатных осей и масштаба таким образом, чтобы для фактора в стандартизированном масштабе начало отсчета было совмещено с <a href="#plan_center">центром области планирования</a>, а в качестве единицы измерения использовался интервал варьирования фактора.</p>
                <p>Например, пусть основной уровень фактора равен 10.0, интервал варьирования - 50.0, тогда верхний и нижний уровень фактора вычисляются соответственно:</p>
                <p>Верх = 10.0 + 50.0 = 60.0,<br>Ниж = 10.0 - 50.0 = -40.0.</p>
                <p>А теперь вычислим верхний и нижний уровни фактора в нормализованном виде:</p>
                <p>ВерхНорм = (60.0 - 10.0) / 50 = 1,<br>НижНорм = (-40.0 - 10.0) / 50 = -1.</p>
                <hr>
              </div>
              <div id="plan_center">
                <h2>Центр области планирования</h2>
                <p>Вектор, компонентами которого являются упорядоченные численные значения <a href="#factor_main">основных уровней факторов</a>, задает точку, являющуюся центром области планирования, в окрестности которой и располагаются все точки плана.</p>
                <hr>
              </div>
              <div id="factor_main">
                <h2>Основной уровень фактора</h2>
                <p>Основной уровень фактора - уровень фактора, в окрестности которого проводится эксперимент.</p>
                <p>Вычисляется основной уровень фактора как среднее арифметическое <a href="#factor_level">верхнего и нижнего уровней фактора</a>.</p>
                <hr>
              </div>
              <div id="factor_level">
                <h2>Уровень фактора</h2>
                <p>Уровень фактора - фиксированное значение фактора, которое фактор принимает в ходе проведения эксперимента.</p>
                <p>Максимальное значение, принимаемое фактором в ходе эксперимента, называют верхним уровнем фактора, а минимальное - нижним уровнем фактора.</p>
                <hr>
              </div>
              <div id="exp_numb">
                <h2>Количество опытов</h2>
                <p>Поскольку из-за действия неуправляемых и неконтролируемых факторов отклик объекта имеет случайный характер, то при проведении эксперимента в каждой <a href="#plan_points"></a> выполняют серии из нескольких параллельных опытов, что позволяет статистически учитывать случайные воздействия на объект исследования.</p>
                <hr>
              </div>
              <div id="interval_factor">
                <h2>Интервал варьирования фактора</h2>
                <p>Интервал варьирования фактора - величина, задающая диапазон отклонения значения фактора от <a href="#factor_level">основного уровня</a> в ходе эксперимента.</p>
                <p>Интервал варьирования фактора вычисляется как половина разности верхнего и нижнего уровней фактора.</p>
                <hr>
              </div>
              <div id="freedom_degree">
                <h2>Число степеней свободы</h2>
                <p>Число степеней свободы - количество независимых наблюдений, по которым вычисляется данная оценка, минус число линейных связей между теми же наблюдаемыми значениями.</p>
                <hr>
              </div>
              <div id="hypo">
                <h2>Гипотеза</h2>
                <p>Статистическая гипотеза - определенное предположение относительно свойств генеральной совокупности, из которой извлечена выборка.</p>
                <hr>
              </div>
              <div id="criteria">
                <h2>Критерий</h2>
                <p>Критерий статистической гипотезы - правило, позволяющее принять или отвергнуть <a href="#hypo">статистическую гипотезу</a> на основании выборочной статистики на выбранном уровне значимости.</p>
                <hr>
              </div>
              <div id="statistic">
                <h2>Статистика</h2>
                <p>Статистика для проверки <a href="#hypo">гипотезы</a> - функция результатов наблюдений, составляющих выборку, которая используется для построения критерия статистической гипотезы.</p>
                <p>Все возможные значения статистики делятся на две части:</p>
                <ul>
                  <li>область принятия гипотезы;</li>
                  <li>критическая область, в которой проверяемая гипотеза отвергается.</li>
                </ul>
                <hr>
              </div>
              <div id="criteria_stat">
                <h2>Критерий статистической гипотезы</h2>
                <p>Критерий статистической гипотезы - правило, позволяющее принять или отвергнуть <a href="#hypo">статистическую гипотезу</a> на основании выборочной статистики на выбранном уровне значимости.</p>
                <hr>
              </div>
              <div id="sign_level">
                <h2>Уровень значимости</h2>
                <p>Уровень значимости - вероятность отвержения правильной гипотезы.</p>
                <hr>
              </div>
              <div id="cochrain_1">
                <h2>Распределение Кохрена</h2>
                <p>Распределение Кохрена - распределение</p>
                <p>Имеет две степени свободы:</p>
                <ol>
                  <li>Число степеней свободы, связанных с той из рассматриваемых дисперсий, которая стоит в числителе - число степеней свободы числителя;</li>
                  <li>Число степеней свободы, связанных с рядом дисперсий, стоящих в знаменателе - число степеней свободы знаменателя.</li>
                </ol>
                <p>Обычно используются таблицы, облегчающие применение G-распределения. В таблицах для ряда значений числа степеней свободы числителя и знаменателя указаны такие значения случайной величины отношения одной из ряда дисперсий, к сумме дисперсий из этого ряда для которых вероятность того, что выборочное отношение не попадет в интервал, ограниченный сверху табличным значением, равна <a href="#sign_level">уровню значимости</a>.</p>
                <hr>
              </div>
              <div id="cochrain_2">
                <h2>Критерий Кохрена</h2>
                <p>Критерий Кохрена - <a href="#criteria">критерий</a>, предназначенный для проверки однородности ряда дисперсий.</p>
                <p>В качестве выборочной статистики для критерия Кохрена используется отношение одной дисперсии из заданного ряда к сумме всех дисперсий этого ряда. Полученное значение выборочной статистики сравнивается с табличным значением G-распределения Кохрена.</p>
                <hr>
              </div>
              <div id="cochrain_3">
                <h2>Критическое значение критерия Кохрена</h2>
                <p>Критическое значение критерия Кохрена - численное значение, выбранное из таблиц <a href="#cochrain_1">G-распределения Кохрена</a> для соответствующего числа степеней свободы числителя и знаменателя на выбранном уровне значимости.</p>
                <p>Например:<br>
m = 3 - число параллельных опытов,<br>
N = 4 - число точек спектра плана,<br>
a = 0.05 - уровень значимости.</p>
                <p>Тогда критическое значение критерия Кохрена <br> Крит_Кох(m-1, N, a): </p>
                <p>Крит_Кох(2, 4, 0.05) = 0.768.</p>
                <hr>
              </div>
              <div id="matrix">
                <h2>Матрица численных значений базисных функций</h2>
                <p>Матрица численных значений базисных функций - матрица, столбцы которой соответствуют <a href="#var_obj">существенным переменным</a> объекта исследования, а строки - точкам плана. Т.о. любой элемент этой матрицы - численное значение базисной функции в конкретной точке плана.</p>
                <p>Например, для двухфакторного объекта список существенных переменных имеет вид:<br>
1, Х1, Х2, Х1*Х2.</p>
                <p>Для исследования объекта строится ПФЭ.</p>
                <p>Тогда матрица численных значений базисных функций:</p>
                <table class="table table-bordered">
              <thead>
                <tr>
                  <th rowspan="2">Точка плана</th>
                  <th colspan="3">Сущ. переменные</th>
                </tr>
                <tr>
                  <th>X1</th>
                  <th>X2</th>
                  <th>X1*X2</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>1</td>
                  <td>-1</td>
                  <td>-1</td>
                  <td>+1</td>
                </tr>
                <tr>
                  <td>2</td>
                  <td>+1</td>
                  <td>-1</td>
                  <td>-1</td>
                </tr>
                <tr>
                  <td>3</td>
                  <td>-1</td>
                  <td>+1</td>
                  <td>-1</td>
                </tr>
                <tr>
                  <td>4</td>
                  <td>+1</td>
                  <td>+1</td>
                  <td>+1</td>
                </tr>
              </tbody>
            </table>
                <hr>
              </div>
              <div id="var_obj">
                <h2>Список существенных переменных объекта</h2>
                <p>Список существенных переменных объекта - часть <a href="#basis">базисных функций</a>: список факторов и их произведений, влияющих на отклик объекта исследования и поэтому представляющих интерес для рассмотрения.</p>
                <hr>
              </div>
              <div id="basis">
                <h2>Базисные функции</h2>
                <p>Базисные функции - система функций, по которым раскладывается в ряд функция отклика объекта.</p>
                <p>Например, при разложении отклика двухфакторного объекта (n=2) в ряд Тейлора система базисных функций включает в себя:
<br>1, Х1, Х2, Х1*Х2, Х1*Х1, Х2*Х2.</p>
                <p>Для объекта с n=3:<br>
1, Х1, Х2, Х3, Х1*Х2, Х1*Х3, Х2*Х3, Х1*Х2*Х3, Х1*Х1, Х2*Х2, Х3*Х3.</p>
                <hr>
              </div>
              <div id="fisher_1">
                <h2>Критерий Фишера</h2>
                <p>Критерий Фишера - <a href="#criteria">критерий</a>, служащий для проверки однородности двух выборочных дисперсий.</p>
                <p>В качестве выборочной статистики для критерия Фишера берется отношение исследуемых дисперсий. Полученное значение выборочной статистики сравнивается с табличным значением F-распределения.</p>
                <p>Если значения выборочной статистики меньше табличного значения F-распределения Фишера с соответствующим числом степеней свободы числителя и знаменателя на выбранном уровне значимости, то принимается нулевая гипотеза об однородности дисперсий.</p>
                <hr>
              </div>
              <div id="fisher_2">
                <h2>Распределение Фишера</h2>
                <p>F-распределение Фишера - распределение отношения двух выборочных дисперсий. Имеет две степени свободы:</p>
                <ol>
                  <li>Число степеней свободы, связанных с той из рассматриваемых дисперсий, которая стоит в числителе - число степеней свободы числителя;</li>
                  <li>Число степеней свободы, связанных с той из рассматриваемых дисперсий, которая стоит в знаменателе - число степеней свободы знаменателя.</li>
                </ol>
                <p>Обычно используются таблицы, облегчающие применение F-распределения. В таблицах для ряда значений числа степеней свободы числителя и знаменателя указаны такие значения случайной величины отношения двух дисперсий, для которых вероятность того, что выборочное отношение двух дисперсий не попадет в интервал, ограниченный сверху табличным значением, равна <a href="#sign_level">уровню значимости</a>.</p>
                <hr>
              </div>
              <div id="fisher_3">
                <h2>Критическое значение критерия Фишера</h2>
                <p>Критическое значение критерия Фишера - численное значение, выбираемое из таблиц F-распределения Фишера с соответствующим числом степеней свободы числителя и знаменателя на выбранном уровне значимости.</p>
                <p>Например:<br>
m = 3 - число параллельных опытов,<br>
N = 4 - число точек спектра плана,<br>
а = 0.05 - уровень значимости.</p>
                <p>Тогда критическое значение критерия Фишера<br>
Крит_Фиш(N-d, N*(m-1), a):</p>
                <p>Крит_Фиш(1, 8, 0.05) = 5.035.</p>
                <hr>
              </div>
            </div>
            </b-card>
        </b-col>
      </b-row>
    </b-container>
  </div>
</template>

<script>
export default {
  created() {},
  data() {
    return {};
  },
  props: {},
  methods: {},
};
</script>

<style scoped></style>
